app/controllers/categories_controller.rb

SELECT * FROM "categories"
---
  def index
    @categories = Category.all

INSERT INTO "categories" ("name", "created_at", "updated_at", "parent_category_id") VALUES(NULL, '2010-11-09 14:27:36', '2010-11-09 14:27:36', NULL)
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save