app/controllers/recipes_controller.rb

  def index
    @recipes = Recipe.all
---
SELECT * FROM "recipes"

  def show
    @recipe = Recipe.find(params[:id])
---
SELECT * FROM "recipes" WHERE ("recipes"."id" = 980190962)

  def edit
    @recipe = Recipe.find(params[:id])
---
SELECT * FROM "recipes" WHERE ("recipes"."id" = 980190962)

  def create
    @recipe = Recipe.new(params[:recipe])

    respond_to do |format|
      if @recipe.save
---
INSERT INTO "recipes" ("name", "directions", "created_at", "directory", "overview", "updated_at", "yield", "ingredients") VALUES(NULL, NULL, '2010-11-09 14:27:36', NULL, NULL, '2010-11-09 14:27:36', NULL, NULL)

  def update
    @recipe = Recipe.find(params[:id])
---
SELECT * FROM "recipes" WHERE ("recipes"."id" = 980190962)

  def destroy
    @recipe = Recipe.find(params[:id])
    @recipe.destroy
---
SELECT * FROM "recipes" WHERE ("recipes"."id" = 980190962)
DELETE FROM "recipes" WHERE "id" = 980190962